---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MajorOverhangFailure
source: html/fa58168d-e595-8817-9f1c-f2fe99c6fe56.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MajorOverhangFailure Property

At least one of the overhangs in the major direction is lower than radius of the wire in the minor direction.

## Syntax (C#)
```csharp
public static FailureDefinitionId MajorOverhangFailure { get; }
```